# ******************************************************************************
#   問題 3: リストの基本                                                          
#                                                                             
#   以下のリストの2番目の要素（バナナ）を出力してください。                      
# ******************************************************************************

# 任意の点数を代入 (例：85)
score = 85

# 外側のif文
if score >= 70:
    # 内側のif文
    if score >= 90:
        print("優")
    else:
        print("良")
elif score >= 50:
    print("可")
else:
    print("再試験")
                

