# ******************************************************************************
#   問題 1: 変数と型                                                             
#                                                                             
#   整数 10 を変数 x に代入し、その型を表示してください。                         
# ******************************************************************************

s = "こんにちは"  # 文字列 (string)
b = "True"         # 真偽値　(boolean)

print(type(s))  # 出力:　<class 'str'>
print(type(b))  # 出力:  <class 'bool'>
